apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_rtccntl.h
/* RTC_CNTL_SLOWMEM_FORCE_NOISO : R/W; bitpos: [2]; default: 1;
 * RTC memory force no ISO
 */

#define RTC_CNTL_SLOWMEM_FORCE_NOISO    (BIT(2))
#define RTC_CNTL_SLOWMEM_FORCE_NOISO_M  (RTC_CNTL_SLOWMEM_FORCE_NOISO_V << RTC_CNTL_SLOWMEM_FORCE_NOISO_S)
#define RTC_CNTL_SLOWMEM_FORCE_NOISO_V  0x00000001
#define RTC_CNTL_SLOWMEM_FORCE_NOISO_S  2

/* RTC_CNTL_FASTMEM_FORCE_ISO : R/W; bitpos: [1]; default: 0;
 * Fast RTC memory force ISO
 */

#define RTC_CNTL_FASTMEM_FORCE_ISO    (BIT(1))
#define RTC_CNTL_FASTMEM_FORCE_ISO_M  (RTC_CNTL_FASTMEM_FORCE_ISO_V << RTC_CNTL_FASTMEM_FORCE_ISO_S)
#define RTC_CNTL_FASTMEM_FORCE_ISO_V  0x00000001
#define RTC_CNTL_FASTMEM_FORCE_ISO_S  1

/* RTC_CNTL_FASTMEM_FORCE_NOISO : R/W; bitpos: [0]; default: 1;
 * Fast RTC memory force no ISO
 */

#define RTC_CNTL_FASTMEM_FORCE_NOISO    (BIT(0))
#define RTC_CNTL_FASTMEM_FORCE_NOISO_M  (RTC_CNTL_FASTMEM_FORCE_NOISO_V << RTC_CNTL_FASTMEM_FORCE_NOISO_S)
#define RTC_CNTL_FASTMEM_FORCE_NOISO_V  0x00000001
#define RTC_CNTL_FASTMEM_FORCE_NOISO_S  0

/* RTC_CNTL_DIG_PWC_REG register
 * configure power of digital core
 */

#define RTC_CNTL_DIG_PWC_REG (DR_REG_RTCCNTL_BASE + 0x8c)

/* RTC_CNTL_DG_WRAP_PD_EN : R/W; bitpos: [31]; default: 0;
 * enable power down digital core in sleep
 */

#define RTC_CNTL_DG_WRAP_PD_EN    (BIT(31))
#define RTC_CNTL_DG_WRAP_PD_EN_M  (RTC_CNTL_DG_WRAP_PD_EN_V << RTC_CNTL_DG_WRAP_PD_EN_S)
#define RTC_CNTL_DG_WRAP_PD_EN_V  0x00000001
#define RTC_CNTL_DG_WRAP_PD_EN_S  31

/* RTC_CNTL_WIFI_PD_EN : R/W; bitpos: [30]; default: 0;
 * enable power down wifi in sleep
 */

#define RTC_CNTL_WIFI_PD_EN    (BIT(30))
#define RTC_CNTL_WIFI_PD_EN_M  (RTC_CNTL_WIFI_PD_EN_V << RTC_CNTL_WIFI_PD_EN_S)
#define RTC_CNTL_WIFI_PD_EN_V  0x00000001
#define RTC_CNTL_WIFI_PD_EN_S  30

/* RTC_CNTL_INTER_RAM4_PD_EN : R/W; bitpos: [29]; default: 0;
 * enable power down internal SRAM 4 in sleep
 */

#define RTC_CNTL_INTER_RAM4_PD_EN    (BIT(29))
#define RTC_CNTL_INTER_RAM4_PD_EN_M  (RTC_CNTL_INTER_RAM4_PD_EN_V << RTC_CNTL_INTER_RAM4_PD_EN_S)
#define RTC_CNTL_INTER_RAM4_PD_EN_V  0x00000001
#define RTC_CNTL_INTER_RAM4_PD_EN_S  29

/* RTC_CNTL_INTER_RAM3_PD_EN : R/W; bitpos: [28]; default: 0;
 * enable power down internal SRAM 3 in sleep
 */

#define RTC_CNTL_INTER_RAM3_PD_EN    (BIT(28))
#define RTC_CNTL_INTER_RAM3_PD_EN_M  (RTC_CNTL_INTER_RAM3_PD_EN_V << RTC_CNTL_INTER_RAM3_PD_EN_S)
#define RTC_CNTL_INTER_RAM3_PD_EN_V  0x00000001
#define RTC_CNTL_INTER_RAM3_PD_EN_S  28

/* RTC_CNTL_INTER_RAM2_PD_EN : R/W; bitpos: [27]; default: 0;
 * enable power down internal SRAM 2 in sleep
 */

#define RTC_CNTL_INTER_RAM2_PD_EN    (BIT(27))
#define RTC_CNTL_INTER_RAM2_PD_EN_M  (RTC_CNTL_INTER_RAM2_PD_EN_V << RTC_CNTL_INTER_RAM2_PD_EN_S)
#define RTC_CNTL_INTER_RAM2_PD_EN_V  0x00000001
#define RTC_CNTL_INTER_RAM2_PD_EN_S  27

/* RTC_CNTL_INTER_RAM1_PD_EN : R/W; bitpos: [26]; default: 0;
 * enable power down internal SRAM 1 in sleep
 */

#define RTC_CNTL_INTER_RAM1_PD_EN    (BIT(26))
#define RTC_CNTL_INTER_RAM1_PD_EN_M  (RTC_CNTL_INTER_RAM1_PD_EN_V << RTC_CNTL_INTER_RAM1_PD_EN_S)
#define RTC_CNTL_INTER_RAM1_PD_EN_V  0x00000001
#define RTC_CNTL_INTER_RAM1_PD_EN_S  26

/* RTC_CNTL_INTER_RAM0_PD_EN : R/W; bitpos: [25]; default: 0;
 * enable power down internal SRAM 0 in sleep
 */

#define RTC_CNTL_INTER_RAM0_PD_EN    (BIT(25))
#define RTC_CNTL_INTER_RAM0_PD_EN_M  (RTC_CNTL_INTER_RAM0_PD_EN_V << RTC_CNTL_INTER_RAM0_PD_EN_S)
#define RTC_CNTL_INTER_RAM0_PD_EN_V  0x00000001
#define RTC_CNTL_INTER_RAM0_PD_EN_S  25

/* RTC_CNTL_ROM0_PD_EN : R/W; bitpos: [24]; default: 0;
 * enable power down ROM in sleep
 */

#define RTC_CNTL_ROM0_PD_EN    (BIT(24))
#define RTC_CNTL_ROM0_PD_EN_M  (RTC_CNTL_ROM0_PD_EN_V << RTC_CNTL_ROM0_PD_EN_S)
#define RTC_CNTL_ROM0_PD_EN_V  0x00000001
#define RTC_CNTL_ROM0_PD_EN_S  24

/* RTC_CNTL_DG_DCDC_PD_EN : R/W; bitpos: [23]; default: 0;
 * enable power down digital dcdc in sleep
 */

#define RTC_CNTL_DG_DCDC_PD_EN    (BIT(23))
#define RTC_CNTL_DG_DCDC_PD_EN_M  (RTC_CNTL_DG_DCDC_PD_EN_V << RTC_CNTL_DG_DCDC_PD_EN_S)
#define RTC_CNTL_DG_DCDC_PD_EN_V  0x00000001
#define RTC_CNTL_DG_DCDC_PD_EN_S  23

/* RTC_CNTL_DG_DCDC_FORCE_PU : R/W; bitpos: [22]; default: 1;
 * digital dcdc force power up
 */

#define RTC_CNTL_DG_DCDC_FORCE_PU    (BIT(22))
#define RTC_CNTL_DG_DCDC_FORCE_PU_M  (RTC_CNTL_DG_DCDC_FORCE_PU_V << RTC_CNTL_DG_DCDC_FORCE_PU_S)
#define RTC_CNTL_DG_DCDC_FORCE_PU_V  0x00000001
#define RTC_CNTL_DG_DCDC_FORCE_PU_S  22

/* RTC_CNTL_DG_DCDC_FORCE_PD : R/W; bitpos: [21]; default: 0;
 * digital dcdc force power down
 */

#define RTC_CNTL_DG_DCDC_FORCE_PD    (BIT(21))
#define RTC_CNTL_DG_DCDC_FORCE_PD_M  (RTC_CNTL_DG_DCDC_FORCE_PD_V << RTC_CNTL_DG_DCDC_FORCE_PD_S)
#define RTC_CNTL_DG_DCDC_FORCE_PD_V  0x00000001
#define RTC_CNTL_DG_DCDC_FORCE_PD_S  21

/* RTC_CNTL_DG_WRAP_FORCE_PU : R/W; bitpos: [20]; default: 1;
 * digital core force power up
 */

#define RTC_CNTL_DG_WRAP_FORCE_PU    (BIT(20))
#define RTC_CNTL_DG_WRAP_FORCE_PU_M  (RTC_CNTL_DG_WRAP_FORCE_PU_V << RTC_CNTL_DG_WRAP_FORCE_PU_S)
#define RTC_CNTL_DG_WRAP_FORCE_PU_V  0x00000001
#define RTC_CNTL_DG_WRAP_FORCE_PU_S  20

/* RTC_CNTL_DG_WRAP_FORCE_PD : R/W; bitpos: [19]; default: 0;
 * digital core force power down
 */

#define RTC_CNTL_DG_WRAP_FORCE_PD    (BIT(19))
#define RTC_CNTL_DG_WRAP_FORCE_PD_M  (RTC_CNTL_DG_WRAP_FORCE_PD_V << RTC_CNTL_DG_WRAP_FORCE_PD_S)
#define RTC_CNTL_DG_WRAP_FORCE_PD_V  0x00000001
#define RTC_CNTL_DG_WRAP_FORCE_PD_S  19

/* RTC_CNTL_WIFI_FORCE_PU : R/W; bitpos: [18]; default: 1;
 * wifi force power up
 */

#define RTC_CNTL_WIFI_FORCE_PU    (BIT(18))
#define RTC_CNTL_WIFI_FORCE_PU_M  (RTC_CNTL_WIFI_FORCE_PU_V << RTC_CNTL_WIFI_FORCE_PU_S)
#define RTC_CNTL_WIFI_FORCE_PU_V  0x00000001
#define RTC_CNTL_WIFI_FORCE_PU_S  18

/* RTC_CNTL_WIFI_FORCE_PD : R/W; bitpos: [17]; default: 0;
 * wifi force power down
 */

#define RTC_CNTL_WIFI_FORCE_PD    (BIT(17))
#define RTC_CNTL_WIFI_FORCE_PD_M  (RTC_CNTL_WIFI_FORCE_PD_V << RTC_CNTL_WIFI_FORCE_PD_S)
#define RTC_CNTL_WIFI_FORCE_PD_V  0x00000001
#define RTC_CNTL_WIFI_FORCE_PD_S  17

/* RTC_CNTL_INTER_RAM4_FORCE_PU : R/W; bitpos: [16]; default: 1;
 * internal SRAM 4 force power up
 */

#define RTC_CNTL_INTER_RAM4_FORCE_PU    (BIT(16))
#define RTC_CNTL_INTER_RAM4_FORCE_PU_M  (RTC_CNTL_INTER_RAM4_FORCE_PU_V << RTC_CNTL_INTER_RAM4_FORCE_PU_S)
#define RTC_CNTL_INTER_RAM4_FORCE_PU_V  0x00000001
#define RTC_CNTL_INTER_RAM4_FORCE_PU_S  16

