apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_rtccntl.h
/* RTC_CNTL_INTER_RAM4_FORCE_PD : R/W; bitpos: [15]; default: 0;
 * internal SRAM 4 force power down
 */

#define RTC_CNTL_INTER_RAM4_FORCE_PD    (BIT(15))
#define RTC_CNTL_INTER_RAM4_FORCE_PD_M  (RTC_CNTL_INTER_RAM4_FORCE_PD_V << RTC_CNTL_INTER_RAM4_FORCE_PD_S)
#define RTC_CNTL_INTER_RAM4_FORCE_PD_V  0x00000001
#define RTC_CNTL_INTER_RAM4_FORCE_PD_S  15

/* RTC_CNTL_INTER_RAM3_FORCE_PU : R/W; bitpos: [14]; default: 1;
 * internal SRAM 3 force power up
 */

#define RTC_CNTL_INTER_RAM3_FORCE_PU    (BIT(14))
#define RTC_CNTL_INTER_RAM3_FORCE_PU_M  (RTC_CNTL_INTER_RAM3_FORCE_PU_V << RTC_CNTL_INTER_RAM3_FORCE_PU_S)
#define RTC_CNTL_INTER_RAM3_FORCE_PU_V  0x00000001
#define RTC_CNTL_INTER_RAM3_FORCE_PU_S  14

/* RTC_CNTL_INTER_RAM3_FORCE_PD : R/W; bitpos: [13]; default: 0;
 * internal SRAM 3 force power down
 */

#define RTC_CNTL_INTER_RAM3_FORCE_PD    (BIT(13))
#define RTC_CNTL_INTER_RAM3_FORCE_PD_M  (RTC_CNTL_INTER_RAM3_FORCE_PD_V << RTC_CNTL_INTER_RAM3_FORCE_PD_S)
#define RTC_CNTL_INTER_RAM3_FORCE_PD_V  0x00000001
#define RTC_CNTL_INTER_RAM3_FORCE_PD_S  13

/* RTC_CNTL_INTER_RAM2_FORCE_PU : R/W; bitpos: [12]; default: 1;
 * internal SRAM 2 force power up
 */

#define RTC_CNTL_INTER_RAM2_FORCE_PU    (BIT(12))
#define RTC_CNTL_INTER_RAM2_FORCE_PU_M  (RTC_CNTL_INTER_RAM2_FORCE_PU_V << RTC_CNTL_INTER_RAM2_FORCE_PU_S)
#define RTC_CNTL_INTER_RAM2_FORCE_PU_V  0x00000001
#define RTC_CNTL_INTER_RAM2_FORCE_PU_S  12

/* RTC_CNTL_INTER_RAM2_FORCE_PD : R/W; bitpos: [11]; default: 0;
 * internal SRAM 2 force power down
 */

#define RTC_CNTL_INTER_RAM2_FORCE_PD    (BIT(11))
#define RTC_CNTL_INTER_RAM2_FORCE_PD_M  (RTC_CNTL_INTER_RAM2_FORCE_PD_V << RTC_CNTL_INTER_RAM2_FORCE_PD_S)
#define RTC_CNTL_INTER_RAM2_FORCE_PD_V  0x00000001
#define RTC_CNTL_INTER_RAM2_FORCE_PD_S  11

/* RTC_CNTL_INTER_RAM1_FORCE_PU : R/W; bitpos: [10]; default: 1;
 * internal SRAM 1 force power up
 */

#define RTC_CNTL_INTER_RAM1_FORCE_PU    (BIT(10))
#define RTC_CNTL_INTER_RAM1_FORCE_PU_M  (RTC_CNTL_INTER_RAM1_FORCE_PU_V << RTC_CNTL_INTER_RAM1_FORCE_PU_S)
#define RTC_CNTL_INTER_RAM1_FORCE_PU_V  0x00000001
#define RTC_CNTL_INTER_RAM1_FORCE_PU_S  10

/* RTC_CNTL_INTER_RAM1_FORCE_PD : R/W; bitpos: [9]; default: 0;
 * internal SRAM 1 force power down
 */

#define RTC_CNTL_INTER_RAM1_FORCE_PD    (BIT(9))
#define RTC_CNTL_INTER_RAM1_FORCE_PD_M  (RTC_CNTL_INTER_RAM1_FORCE_PD_V << RTC_CNTL_INTER_RAM1_FORCE_PD_S)
#define RTC_CNTL_INTER_RAM1_FORCE_PD_V  0x00000001
#define RTC_CNTL_INTER_RAM1_FORCE_PD_S  9

/* RTC_CNTL_INTER_RAM0_FORCE_PU : R/W; bitpos: [8]; default: 1;
 * internal SRAM 0 force power up
 */

#define RTC_CNTL_INTER_RAM0_FORCE_PU    (BIT(8))
#define RTC_CNTL_INTER_RAM0_FORCE_PU_M  (RTC_CNTL_INTER_RAM0_FORCE_PU_V << RTC_CNTL_INTER_RAM0_FORCE_PU_S)
#define RTC_CNTL_INTER_RAM0_FORCE_PU_V  0x00000001
#define RTC_CNTL_INTER_RAM0_FORCE_PU_S  8

/* RTC_CNTL_INTER_RAM0_FORCE_PD : R/W; bitpos: [7]; default: 0;
 * internal SRAM 0 force power down
 */

#define RTC_CNTL_INTER_RAM0_FORCE_PD    (BIT(7))
#define RTC_CNTL_INTER_RAM0_FORCE_PD_M  (RTC_CNTL_INTER_RAM0_FORCE_PD_V << RTC_CNTL_INTER_RAM0_FORCE_PD_S)
#define RTC_CNTL_INTER_RAM0_FORCE_PD_V  0x00000001
#define RTC_CNTL_INTER_RAM0_FORCE_PD_S  7

/* RTC_CNTL_ROM0_FORCE_PU : R/W; bitpos: [6]; default: 1;
 * ROM force power up
 */

#define RTC_CNTL_ROM0_FORCE_PU    (BIT(6))
#define RTC_CNTL_ROM0_FORCE_PU_M  (RTC_CNTL_ROM0_FORCE_PU_V << RTC_CNTL_ROM0_FORCE_PU_S)
#define RTC_CNTL_ROM0_FORCE_PU_V  0x00000001
#define RTC_CNTL_ROM0_FORCE_PU_S  6

/* RTC_CNTL_ROM0_FORCE_PD : R/W; bitpos: [5]; default: 0;
 * ROM force power down
 */

#define RTC_CNTL_ROM0_FORCE_PD    (BIT(5))
#define RTC_CNTL_ROM0_FORCE_PD_M  (RTC_CNTL_ROM0_FORCE_PD_V << RTC_CNTL_ROM0_FORCE_PD_S)
#define RTC_CNTL_ROM0_FORCE_PD_V  0x00000001
#define RTC_CNTL_ROM0_FORCE_PD_S  5

/* RTC_CNTL_LSLP_MEM_FORCE_PU : R/W; bitpos: [4]; default: 1;
 * memories in digital core force no PD in sleep
 */

#define RTC_CNTL_LSLP_MEM_FORCE_PU    (BIT(4))
#define RTC_CNTL_LSLP_MEM_FORCE_PU_M  (RTC_CNTL_LSLP_MEM_FORCE_PU_V << RTC_CNTL_LSLP_MEM_FORCE_PU_S)
#define RTC_CNTL_LSLP_MEM_FORCE_PU_V  0x00000001
#define RTC_CNTL_LSLP_MEM_FORCE_PU_S  4

/* RTC_CNTL_LSLP_MEM_FORCE_PD : R/W; bitpos: [3]; default: 0;
 * memories in digital core force PD in sleep
 */

#define RTC_CNTL_LSLP_MEM_FORCE_PD    (BIT(3))
#define RTC_CNTL_LSLP_MEM_FORCE_PD_M  (RTC_CNTL_LSLP_MEM_FORCE_PD_V << RTC_CNTL_LSLP_MEM_FORCE_PD_S)
#define RTC_CNTL_LSLP_MEM_FORCE_PD_V  0x00000001
#define RTC_CNTL_LSLP_MEM_FORCE_PD_S  3

/* RTC_CNTL_DIG_ISO_REG register
 * configure ISO of digital core
 */

#define RTC_CNTL_DIG_ISO_REG (DR_REG_RTCCNTL_BASE + 0x90)

/* RTC_CNTL_DG_WRAP_FORCE_NOISO : R/W; bitpos: [31]; default: 1;
 * digital core force no ISO
 */

#define RTC_CNTL_DG_WRAP_FORCE_NOISO    (BIT(31))
#define RTC_CNTL_DG_WRAP_FORCE_NOISO_M  (RTC_CNTL_DG_WRAP_FORCE_NOISO_V << RTC_CNTL_DG_WRAP_FORCE_NOISO_S)
#define RTC_CNTL_DG_WRAP_FORCE_NOISO_V  0x00000001
#define RTC_CNTL_DG_WRAP_FORCE_NOISO_S  31

/* RTC_CNTL_DG_WRAP_FORCE_ISO : R/W; bitpos: [30]; default: 0;
 * digital core force ISO
 */

#define RTC_CNTL_DG_WRAP_FORCE_ISO    (BIT(30))
#define RTC_CNTL_DG_WRAP_FORCE_ISO_M  (RTC_CNTL_DG_WRAP_FORCE_ISO_V << RTC_CNTL_DG_WRAP_FORCE_ISO_S)
#define RTC_CNTL_DG_WRAP_FORCE_ISO_V  0x00000001
#define RTC_CNTL_DG_WRAP_FORCE_ISO_S  30

/* RTC_CNTL_WIFI_FORCE_NOISO : R/W; bitpos: [29]; default: 1;
 * wifi force no ISO
 */

#define RTC_CNTL_WIFI_FORCE_NOISO    (BIT(29))
#define RTC_CNTL_WIFI_FORCE_NOISO_M  (RTC_CNTL_WIFI_FORCE_NOISO_V << RTC_CNTL_WIFI_FORCE_NOISO_S)
#define RTC_CNTL_WIFI_FORCE_NOISO_V  0x00000001
#define RTC_CNTL_WIFI_FORCE_NOISO_S  29

/* RTC_CNTL_WIFI_FORCE_ISO : R/W; bitpos: [28]; default: 0;
 * wifi force ISO
 */

#define RTC_CNTL_WIFI_FORCE_ISO    (BIT(28))
#define RTC_CNTL_WIFI_FORCE_ISO_M  (RTC_CNTL_WIFI_FORCE_ISO_V << RTC_CNTL_WIFI_FORCE_ISO_S)
#define RTC_CNTL_WIFI_FORCE_ISO_V  0x00000001
#define RTC_CNTL_WIFI_FORCE_ISO_S  28

/* RTC_CNTL_INTER_RAM4_FORCE_NOISO : R/W; bitpos: [27]; default: 1;
 * internal SRAM 4 force no ISO
 */

