apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_rtccntl.h
#define RTC_CNTL_INTER_RAM4_FORCE_NOISO    (BIT(27))
#define RTC_CNTL_INTER_RAM4_FORCE_NOISO_M  (RTC_CNTL_INTER_RAM4_FORCE_NOISO_V << RTC_CNTL_INTER_RAM4_FORCE_NOISO_S)
#define RTC_CNTL_INTER_RAM4_FORCE_NOISO_V  0x00000001
#define RTC_CNTL_INTER_RAM4_FORCE_NOISO_S  27

/* RTC_CNTL_INTER_RAM4_FORCE_ISO : R/W; bitpos: [26]; default: 0;
 * internal SRAM 4 force ISO
 */

#define RTC_CNTL_INTER_RAM4_FORCE_ISO    (BIT(26))
#define RTC_CNTL_INTER_RAM4_FORCE_ISO_M  (RTC_CNTL_INTER_RAM4_FORCE_ISO_V << RTC_CNTL_INTER_RAM4_FORCE_ISO_S)
#define RTC_CNTL_INTER_RAM4_FORCE_ISO_V  0x00000001
#define RTC_CNTL_INTER_RAM4_FORCE_ISO_S  26

/* RTC_CNTL_INTER_RAM3_FORCE_NOISO : R/W; bitpos: [25]; default: 1;
 * internal SRAM 3 force no ISO
 */

#define RTC_CNTL_INTER_RAM3_FORCE_NOISO    (BIT(25))
#define RTC_CNTL_INTER_RAM3_FORCE_NOISO_M  (RTC_CNTL_INTER_RAM3_FORCE_NOISO_V << RTC_CNTL_INTER_RAM3_FORCE_NOISO_S)
#define RTC_CNTL_INTER_RAM3_FORCE_NOISO_V  0x00000001
#define RTC_CNTL_INTER_RAM3_FORCE_NOISO_S  25

/* RTC_CNTL_INTER_RAM3_FORCE_ISO : R/W; bitpos: [24]; default: 0;
 * internal SRAM 3 force ISO
 */

#define RTC_CNTL_INTER_RAM3_FORCE_ISO    (BIT(24))
#define RTC_CNTL_INTER_RAM3_FORCE_ISO_M  (RTC_CNTL_INTER_RAM3_FORCE_ISO_V << RTC_CNTL_INTER_RAM3_FORCE_ISO_S)
#define RTC_CNTL_INTER_RAM3_FORCE_ISO_V  0x00000001
#define RTC_CNTL_INTER_RAM3_FORCE_ISO_S  24

/* RTC_CNTL_INTER_RAM2_FORCE_NOISO : R/W; bitpos: [23]; default: 1;
 * internal SRAM 2 force no ISO
 */

#define RTC_CNTL_INTER_RAM2_FORCE_NOISO    (BIT(23))
#define RTC_CNTL_INTER_RAM2_FORCE_NOISO_M  (RTC_CNTL_INTER_RAM2_FORCE_NOISO_V << RTC_CNTL_INTER_RAM2_FORCE_NOISO_S)
#define RTC_CNTL_INTER_RAM2_FORCE_NOISO_V  0x00000001
#define RTC_CNTL_INTER_RAM2_FORCE_NOISO_S  23

/* RTC_CNTL_INTER_RAM2_FORCE_ISO : R/W; bitpos: [22]; default: 0;
 * internal SRAM 2 force ISO
 */

#define RTC_CNTL_INTER_RAM2_FORCE_ISO    (BIT(22))
#define RTC_CNTL_INTER_RAM2_FORCE_ISO_M  (RTC_CNTL_INTER_RAM2_FORCE_ISO_V << RTC_CNTL_INTER_RAM2_FORCE_ISO_S)
#define RTC_CNTL_INTER_RAM2_FORCE_ISO_V  0x00000001
#define RTC_CNTL_INTER_RAM2_FORCE_ISO_S  22

/* RTC_CNTL_INTER_RAM1_FORCE_NOISO : R/W; bitpos: [21]; default: 1;
 * internal SRAM 1 force no ISO
 */

#define RTC_CNTL_INTER_RAM1_FORCE_NOISO    (BIT(21))
#define RTC_CNTL_INTER_RAM1_FORCE_NOISO_M  (RTC_CNTL_INTER_RAM1_FORCE_NOISO_V << RTC_CNTL_INTER_RAM1_FORCE_NOISO_S)
#define RTC_CNTL_INTER_RAM1_FORCE_NOISO_V  0x00000001
#define RTC_CNTL_INTER_RAM1_FORCE_NOISO_S  21

/* RTC_CNTL_INTER_RAM1_FORCE_ISO : R/W; bitpos: [20]; default: 0;
 * internal SRAM 1 force ISO
 */

#define RTC_CNTL_INTER_RAM1_FORCE_ISO    (BIT(20))
#define RTC_CNTL_INTER_RAM1_FORCE_ISO_M  (RTC_CNTL_INTER_RAM1_FORCE_ISO_V << RTC_CNTL_INTER_RAM1_FORCE_ISO_S)
#define RTC_CNTL_INTER_RAM1_FORCE_ISO_V  0x00000001
#define RTC_CNTL_INTER_RAM1_FORCE_ISO_S  20

/* RTC_CNTL_INTER_RAM0_FORCE_NOISO : R/W; bitpos: [19]; default: 1;
 * internal SRAM 0 force no ISO
 */

#define RTC_CNTL_INTER_RAM0_FORCE_NOISO    (BIT(19))
#define RTC_CNTL_INTER_RAM0_FORCE_NOISO_M  (RTC_CNTL_INTER_RAM0_FORCE_NOISO_V << RTC_CNTL_INTER_RAM0_FORCE_NOISO_S)
#define RTC_CNTL_INTER_RAM0_FORCE_NOISO_V  0x00000001
#define RTC_CNTL_INTER_RAM0_FORCE_NOISO_S  19

/* RTC_CNTL_INTER_RAM0_FORCE_ISO : R/W; bitpos: [18]; default: 0;
 * internal SRAM 0 force ISO
 */

#define RTC_CNTL_INTER_RAM0_FORCE_ISO    (BIT(18))
#define RTC_CNTL_INTER_RAM0_FORCE_ISO_M  (RTC_CNTL_INTER_RAM0_FORCE_ISO_V << RTC_CNTL_INTER_RAM0_FORCE_ISO_S)
#define RTC_CNTL_INTER_RAM0_FORCE_ISO_V  0x00000001
#define RTC_CNTL_INTER_RAM0_FORCE_ISO_S  18

/* RTC_CNTL_ROM0_FORCE_NOISO : R/W; bitpos: [17]; default: 1;
 * ROM force no ISO
 */

#define RTC_CNTL_ROM0_FORCE_NOISO    (BIT(17))
#define RTC_CNTL_ROM0_FORCE_NOISO_M  (RTC_CNTL_ROM0_FORCE_NOISO_V << RTC_CNTL_ROM0_FORCE_NOISO_S)
#define RTC_CNTL_ROM0_FORCE_NOISO_V  0x00000001
#define RTC_CNTL_ROM0_FORCE_NOISO_S  17

/* RTC_CNTL_ROM0_FORCE_ISO : R/W; bitpos: [16]; default: 0;
 * ROM force ISO
 */

#define RTC_CNTL_ROM0_FORCE_ISO    (BIT(16))
#define RTC_CNTL_ROM0_FORCE_ISO_M  (RTC_CNTL_ROM0_FORCE_ISO_V << RTC_CNTL_ROM0_FORCE_ISO_S)
#define RTC_CNTL_ROM0_FORCE_ISO_V  0x00000001
#define RTC_CNTL_ROM0_FORCE_ISO_S  16

/* RTC_CNTL_DG_PAD_FORCE_HOLD : R/W; bitpos: [15]; default: 0;
 * digital pad force hold
 */

#define RTC_CNTL_DG_PAD_FORCE_HOLD    (BIT(15))
#define RTC_CNTL_DG_PAD_FORCE_HOLD_M  (RTC_CNTL_DG_PAD_FORCE_HOLD_V << RTC_CNTL_DG_PAD_FORCE_HOLD_S)
#define RTC_CNTL_DG_PAD_FORCE_HOLD_V  0x00000001
#define RTC_CNTL_DG_PAD_FORCE_HOLD_S  15

/* RTC_CNTL_DG_PAD_FORCE_UNHOLD : R/W; bitpos: [14]; default: 1;
 * digital pad force un-hold
 */

#define RTC_CNTL_DG_PAD_FORCE_UNHOLD    (BIT(14))
#define RTC_CNTL_DG_PAD_FORCE_UNHOLD_M  (RTC_CNTL_DG_PAD_FORCE_UNHOLD_V << RTC_CNTL_DG_PAD_FORCE_UNHOLD_S)
#define RTC_CNTL_DG_PAD_FORCE_UNHOLD_V  0x00000001
#define RTC_CNTL_DG_PAD_FORCE_UNHOLD_S  14

/* RTC_CNTL_DG_PAD_FORCE_ISO : R/W; bitpos: [13]; default: 0;
 * digital pad force ISO
 */

#define RTC_CNTL_DG_PAD_FORCE_ISO    (BIT(13))
#define RTC_CNTL_DG_PAD_FORCE_ISO_M  (RTC_CNTL_DG_PAD_FORCE_ISO_V << RTC_CNTL_DG_PAD_FORCE_ISO_S)
#define RTC_CNTL_DG_PAD_FORCE_ISO_V  0x00000001
#define RTC_CNTL_DG_PAD_FORCE_ISO_S  13

/* RTC_CNTL_DG_PAD_FORCE_NOISO : R/W; bitpos: [12]; default: 1;
 * digital pad force no ISO
 */

#define RTC_CNTL_DG_PAD_FORCE_NOISO    (BIT(12))
#define RTC_CNTL_DG_PAD_FORCE_NOISO_M  (RTC_CNTL_DG_PAD_FORCE_NOISO_V << RTC_CNTL_DG_PAD_FORCE_NOISO_S)
#define RTC_CNTL_DG_PAD_FORCE_NOISO_V  0x00000001
#define RTC_CNTL_DG_PAD_FORCE_NOISO_S  12

/* RTC_CNTL_DG_PAD_AUTOHOLD_EN : R/W; bitpos: [11]; default: 0;
 * digital pad enable auto-hold
 */

#define RTC_CNTL_DG_PAD_AUTOHOLD_EN    (BIT(11))
#define RTC_CNTL_DG_PAD_AUTOHOLD_EN_M  (RTC_CNTL_DG_PAD_AUTOHOLD_EN_V << RTC_CNTL_DG_PAD_AUTOHOLD_EN_S)
#define RTC_CNTL_DG_PAD_AUTOHOLD_EN_V  0x00000001
#define RTC_CNTL_DG_PAD_AUTOHOLD_EN_S  11

/* RTC_CNTL_CLR_DG_PAD_AUTOHOLD : WO; bitpos: [10]; default: 0;
 * wtite only register to clear digital pad auto-hold
 */

#define RTC_CNTL_CLR_DG_PAD_AUTOHOLD    (BIT(10))
#define RTC_CNTL_CLR_DG_PAD_AUTOHOLD_M  (RTC_CNTL_CLR_DG_PAD_AUTOHOLD_V << RTC_CNTL_CLR_DG_PAD_AUTOHOLD_S)
#define RTC_CNTL_CLR_DG_PAD_AUTOHOLD_V  0x00000001
#define RTC_CNTL_CLR_DG_PAD_AUTOHOLD_S  10

/* RTC_CNTL_DG_PAD_AUTOHOLD : RO; bitpos: [9]; default: 0;
 * read only register to indicate digital pad auto-hold status
 */

